app/controllers/index_controller.rb

    def salvar_objeto_repositorio_banco(json)
        json.each do |item|
            if item[:linguagem][:message]
                return
            else
                item[:linguagem]['items'].each do |subitem|
                    repositorio = Repositorio.find_or_initialize_by(nome: "full_name")
---
SELECT  "repositorios".* FROM "repositorios" WHERE "repositorios"."nome" = $1 LIMIT $2  [["nome", "full_name"], ["LIMIT", 1]]